var _city=new Array(35);
  _city[0]=new Array(["--省/市--","--市/区--"],[0,0]);
  _city[1]=new Array(["安徽","合肥市","淮北市","亳州市","宿州市","蚌埠市","阜阳市","淮南市","滁州市","六安市","马鞍山市","芜湖市","宣城市","铜陵市","池州市","安庆市","黄山市"],[1,101,102,103,104,105,106,107,108,109,110,111,112,113,114,115,116]);
  _city[2]=new Array(["北京","昌平区","朝阳区","大兴区","东城区","房山区","丰台区","海淀区","怀柔区","门头沟区","密云县","平谷区","石景山区","顺义区","通州区","西城区","延庆县"],[2,201,202,203,204,205,206,207,208,209,210,211,212,213,214,215,216]);
  _city[3]=new Array(["重庆","万州区","涪陵区","渝中区","大渡口区","江北区","沙坪坝区","九龙坡区","南岸区","北碚区","万盛区","双桥区","渝北区","巴南区","黔江区","长寿区","江津区","合川区","永川区","南川区","纂江县","潼南县","铜梁县","大足县","荣昌县","璧山县","梁平县","城口县","丰都县","垫江县","武隆县","忠县","开县","云阳县","奉节县","巫山县","巫溪县","石柱县","秀山县","酉阳县","彭水县"],[3,301,302,303,304,305,306,307,308,309,310,311,312,313,314,315,316,317,318,319,320,321,322,323,324,325,326,327,328,329,330,331,332,333,334,335,336,337,338,339,340]);
  _city[4]=new Array(["福建","福州市","厦门市","漳州市","泉州市","莆田市","三明市","南平市","龙岩市","宁德市"],[4,401,402,403,404,405,406,407,408,409]);
  _city[5]=new Array(["甘肃","兰州市","白银市","定西市","甘南州","嘉峪关市","金昌市","酒泉市","临夏州","陇南市","平凉市","庆阳市","天水市","武威市","张掖市"],[5,501,502,503,504,505,506,507,508,509,510,511,512,513,514]);
  _city[6]=new Array(["广东","广州市","深圳市","珠海市","汕头市","佛山市","韶关市","河源市","梅州市","惠州市","汕尾市","东莞市","中山市","江门市","阳江市","湛江市","茂名市","肇庆市","清远市","潮州市","揭阳市","云浮市"],[6,601,602,603,604,605,606,607,608,609,610,611,612,613,614,615,616,617,618,619,620,621]);
  _city[7]=new Array(["广西","南宁市","柳州市","桂林市","梧州市","北海市","城防港","钦州市","贵港市","玉林市","百色市","贺州市","河池市","来宾市","崇左市"],[7,701,702,703,704,705,706,707,708,709,710,711,712,713,714]);
  _city[8]=new Array(["贵州","贵阳市","遵义市","六盘水市","安顺市","毕节市","铜仁市","黔东南","黔南","黔西南"],[8,801,802,803,804,805,806,807,808,809]);
  _city[9]=new Array(["海南","海口市","三亚市","其他"],[9,901,902,903]);
 _city[10]=new Array(["河北","石家庄市","唐山市","秦皇岛市","邯郸市","邢台市","保定市","张家口市","承德市","沧州市","廊坊市","衡水市"],[10,1001,1002,1003,1004,1005,1006,1007,1008,1009,1010,1011]);
 _city[11]=new Array(["河南","郑州市","开封市","洛阳市","南阳市","漯河市","许昌市","三门峡市","平顶山市","周口市","驻马店市","新乡市","鹤壁市","焦作市","濮阳市","安阳市","商丘市","信阳市","济源市"],[11,1101,1102,1103,1104,1105,1106,1107,1108,1109,1110,1111,1112,1113,1114,1115,1116,1117,1118]);
 _city[12]=new Array(["黑龙江","哈尔滨市","齐齐哈尔市","牡丹江市","佳木斯市","大庆市","鸡西市","双鸭山市","伊春市","七台河市","鹤岗市","黑河市","绥化市","大兴安岭","绥芬河市","抚远县"],[12,1201,1202,1203,1204,1205,1206,1207,1208,1209,1210,1211,1212,1213,1214,1215]);
 _city[13]=new Array(["湖北","武汉市","黄石市","襄阳市","荆州市","宜昌市","黄冈市","鄂州市","十堰市","孝感市","荆门市","咸宁市","随州市","恩施州","神农架","仙桃市","天门市","潜江市"],[13,1301,1302,1303,1304,1305,1306,1307,1308,1309,1310,1311,1312,1313,1314,1315,1316,1317]);
 _city[14]=new Array(["湖南","长沙市","株洲市","湘潭市","岳阳市","益阳市","常德市","衡阳市","邵阳市","张家界市","郴州市","永州市","怀化市","娄底市","湘西自治州"],[14,1401,1402,1403,1404,1405,1406,1407,1408,1409,1410,1411,1412,1413,1414]);
 _city[15]=new Array(["吉林","长春市","吉林市","四平市","辽源市","通化市","白山市","松原市","白城市","延边州"],[15,1501,1502,1503,1504,1505,1506,1507,1508,1509]);
 _city[16]=new Array(["江苏","南京市","无锡市","徐州市","常州市","苏州市","南通市","连云港市","淮安市","盐城市","扬州市","镇江市","泰州市","宿迁市"],[16,1601,1602,1603,1604,1605,1606,1607,1608,1609,1610,1611,1612,1613]);
 _city[17]=new Array(["江西","南昌市","九江市","景德镇市","萍乡市","新余市","上饶市","鹰潭市","吉安市","赣州市","抚州市","宜春市"],[17,1701,1702,1703,1704,1705,1706,1707,1708,1709,1710,1711]);
 _city[18]=new Array(["辽宁","沈阳市","大连市","鞍山市","抚顺市","本溪市","丹东市","锦州市","营口市","阜新市","辽阳市","铁岭市","朝阳市","盘锦市","葫芦岛市"],[18,1801,1802,1803,1804,1805,1806,1807,1808,1809,1810,1811,1812,1813,1814]);
 _city[19]=new Array(["内蒙古","呼和浩特市","包头市","呼伦贝尔市","兴安盟","通辽市","赤峰市","锡林郭勒盟","乌兰察布市","鄂尔多斯市","巴彦淖尔市","乌海市","阿拉善盟"],[19,1901,1902,1903,1904,1905,1906,1907,1908,1909,1910,1911,1912]);
 _city[20]=new Array(["宁夏","银川市","固原市","石嘴山市","中卫市","吴中市"],[20,2001,2002,2003,2004,2005]);
 _city[21]=new Array(["青海","西宁市","海东市","果洛州","海北州","海南州","海西州","黄南州","玉树州"],[21,2101,2102,2103,2104,2105,2106,2107,2108]);
 _city[22]=new Array(["山东","济南市","滨州市","德州市","东营市","菏泽市","济宁市","莱芜市","聊城市","临沂市","青岛市","日照市","泰安市","威海市","潍坊市","烟台市","枣庄市","淄博市"],[22,2201,2202,2203,2204,2205,2206,2207,2208,2209,2210,2211,2212,2213,2214,2215,2216,2217,2218,2219,2220,2221,2222]);
 _city[23]=new Array(["山西","大同市","长治市","晋城市","晋中市","临汾市","吕梁市","朔州市","太原市","忻州市","阳泉市","运城市"],[23,2301,2302,2303,2304,2305,2306,2307,2308,2309,2310,2311]);
 _city[24]=new Array(["陕西","西安市","安康市","宝鸡市","汉中市","商洛市","铜川市","渭南市","咸阳市","延安市","榆林市"],[24,2401,2402,2403,2404,2405,2406,2407,2408,2409,2410]);
 _city[25]=new Array(["上海","黄浦区","卢湾区","徐汇区","长宁区","静安区","普陀区","闸北区","虹口区","杨浦区","闵行区","宝山区","嘉定区","浦东新区","金山区","松江区","青浦区","南汇区","奉贤区","崇明县"],[25,2501,2502,2503,2504,2505,2506,2507,2508,2509,2510,2511,2512,2513,2514,2515,2516,2517,2518,2519]);
 _city[26]=new Array(["四川","成都市","自贡市","攀枝花市","泸州市","德阳市","绵阳市","广元市","遂宁市","内江市","乐山市","南充市","眉山市","宜宾市","广安市","达州市","雅安市","巴中市","资阳市","阿坝州","甘孜州","凉山州"],[26,2601,2602,2603,2604,2605,2606,2607,2608,2609,2610,2611,2612,2613,2614,2615,2616,2617,2618,2619,2620,2621]);
 _city[27]=new Array(["台湾","台北市","高雄市","基隆市","台中市","台南市","新竹市","嘉义市","新北市","宜兰县","桃源县","新竹县","苗栗县","台中县","彰化县","南投县","云林县","嘉义县","台南县","高雄县","屏东县","澎湖县","台东县","花莲县","其他"],[27,2701,2702,2703,2704,2705,2706,2707,2708,2709,2710,2711,2712,2713,2714,2715,2716,2717,2718,2719,2720,2721,2722,2723,2724]);
 _city[28]=new Array(["天津","和平区","河东区","河西区","南开区","河北区","红桥区","塘沽区","汉沽区","大港区","东丽区","西青区","津南区","北辰区","武清区","宝坻区","宁河县","静海县","蓟县","海滨新区","保税区"],[28,2801,2802,2803,2804,2805,2806,2807,2808,2809,2810,2811,2812,2813,2814,2815,2816,2817,2818,2819,2820]);
 _city[29]=new Array(["西藏","拉萨市","阿里","昌都","林芝","那曲","日喀则","山南"],[29,2901,2902,2903,2904,2905,2906,2907]);
 _city[30]=new Array(["新疆","乌鲁木齐市","伊犁","塔城","阿勒泰","博州","昌吉州","吐鲁番","哈密","巴州","阿克苏","克州","喀什","和田","克拉玛依市","石河子市","阿拉尔市","图木舒克市","五家渠市","北屯市","铁门关市"],[30,3001,3002,3003,3004,3005,3006,3007,3008,3009,3010,3011,3012,3013,3014,3015,3016,3017,3018,3019,3020]);
 _city[31]=new Array(["云南","昆明市","曲靖市","玉溪市","昭通市","楚雄州","红河州","丽江市","迪庆州","文山州","版纳州","普洱市","大理州","保山市","德宏州","怒江州","临沧市"],[31,3101,3102,3103,3104,3105,3106,3107,3108,3109,3110,3111,3112,3113,3114,3115,3116]);
 _city[32]=new Array(["浙江","杭州市","湖州市","嘉兴市","金华市","丽水市","宁波市","衢州市","绍兴市","台州市","温州市","舟山市"],[32,3201,3202,3203,3204,3205,3206,3207,3208,3209,3210,3211]);
 _city[33]=new Array(["香港","中西区","东区","九龙城区","观塘区","南区","深水埗区","黄大仙区","湾仔区","油尖旺区","离岛区","葵青区","北区","西贡区","沙田区","屯门区","大埔区","荃湾区","元朗区","其他"],[33,3301,3302,3303,3304,3305,3306,3307,3308,3309,3310,3311,3312,3313,3314,3315,3316,3317,3318,3319,]);
 _city[34]=new Array(["澳门","花地玛堂区","圣安多尼堂区","大堂区","望德堂区","风顺堂区","氹仔","路环","其他"],[34,3401,3402,3403,3404,3405,3406,3407,3408]);
 _city[35]=new Array(["海外","美国","英国","法国","俄罗斯","加拿大","巴西","澳大利亚","印尼","泰国","马来西亚","新加坡","菲律宾","越南","印度","日本","新西兰","韩国","德国","意大利","爱尔兰","荷兰","瑞士","乌克兰","南非","芬兰","瑞典","奥地利","西班牙","比利时","挪威","丹麦","波兰","阿根廷","白俄罗斯","哥伦比亚","古巴","埃及","希腊","匈牙利","伊朗","蒙古","墨西哥","葡萄牙","沙特阿拉伯","土耳其","其他"],[35,3501,3502,3503,3504,3505,3506,3507,3508,3509,3510,3511,3512,3513,3514,3515,3516,3517,3518,3519,3520,3521,3522,3523,3524,3525,3526,3527,3528,3529,3530,3531,3532,3533,3534,3535,3536,3537,3538,3539,3540,3541,3542,3543,3544,3545,3546]);
 
//function _write_in_sql(){
//	str = '';
//	for (var i = 1;i < _city.length;i++){
//		str += '('+_city[i][1][0]+',"'+_city[i][0][0]+'","",'+0+','+i+',"-'+i+'-"),';
//		for (var j = 1; j <_city[i][0].length;j++){
//			var m = _zeroFill(j,2);
//			str += '('+_city[i][1][j]+',"'+_city[i][0][j]+'","",'+i+','+j+',"-'+i+'-'+i+m+'-"),';
//		}
//	}
//	$.ajax({
//		url:'/ajax/provinceCityWriteInSql?'+Date.parse(new Date()),
//		type:'POST',
//		data:{data:str},
//		success:function(response){
//			alert(response);
//		}
//	});
//}
 
function _loadProvince(id ,cityId){
	if ($("#"+id).length <= 0)return false;
	var _pid = arguments[2] ? arguments[2] : false;
	var _cid = arguments[3] ? arguments[3] : false;
	var pId = false === _pid ? $("#"+id).val() : parseInt(_pid);
	var cId = false === _cid ? $("#"+cityId).val() : parseInt(_cid);
	var htmlProvince = '';
	for (var i = 0; i < _city.length; i++){
		var status = pId == i ? 'selected' : '';
		if (pId == i){
			prv = _city[i][0][0];
		}
		htmlProvince += '<option class="province" value="'+i+'" '+status+'>'+_city[i][0][0]+'</option>';
	}
	$("#"+id).html(htmlProvince);
	var htmlCity = '';
	if (_city[pId][0].length > 0){
		for (var i = 0; i < _city[pId][0].length; i++){
			var cityName = _city[pId][0][i];
			if (0 == i) cityName = _city[0][0][1];
			var status = cId == i ? 'selected' : '';
			htmlCity += '<option class="city" value="'+i+'" '+status+'>'+cityName+'</option>';
		}
	}
	$("#"+cityId).html(htmlCity);
	return prv;
}
function _loadProvinceName(id ,cityId){
	var _pid = arguments[2] ? arguments[2] : false;
	var _cid = arguments[3] ? arguments[3] : false;
	var pId = false === _pid ? $("#"+id).val() : parseInt(_pid);
	var cId = false === _cid ? $("#"+cityId).val() : parseInt(_cid);
	var prv = pId;
	var htmlProvince = '';
	var reg = new RegExp("^[0-9]*$");
	for (var i = 0; i < _city.length; i++){
		if (reg.test(pId)){
			var status = pId == i ? 'selected' : '';
		}else{
			if (pId == _city[i][0][0]){
				var status = 'selected';
				pId = i;
			}else{
				var status = '';
			}
		}
		
		htmlProvince += '<option class="province" rel="'+i+'" value="'+_city[i][0][0]+'" '+status+'>'+_city[i][0][0]+'</option>';
	}
	$("#"+id).html(htmlProvince);
	var htmlCity = '';
	if (_city[pId][0].length > 0){
		for (var i = 0; i < _city[pId][0].length; i++){
			var cityName = _city[pId][0][i];
			if (0 == i) cityName = _city[0][0][1];
			var status = cId == i ? 'selected' : '';
			htmlCity += '<option class="city" rel="'+i+'" value="'+cityName+'" '+status+'>'+cityName+'</option>';
		}
	}
	$("#"+cityId).html(htmlCity);
	return prv;
}

function _resetCityName(cityId, _pid){
	if (!_pid) return false;
	var htmlCity = '<option rel="0" selected>--请选择--</option>';
	if (_city[pId][0].length > 0){
		for (var i = 0; i < _city[pId][0].length; i++){
			var cityName = _city[pId][0][i];
			if (0 == i) cityName = _city[0][0][1];
			var status = cId == i ? 'selected' : '';
			htmlCity += '<option class="city" rel="'+i+'" value="'+cityName+'" '+status+'>'+cityName+'</option>';
		}
	}
	$("#"+cityId).html(htmlCity);
}
 
// function loadProvince(id,CityId) {
//  var obj=document.getElementById(id);
//  var objCity=document.getElementById(CityId);
//  for(var i=0;i<_city.length;i++)
//  {
//     if(_city[i])
//     {
//        obj.options[obj.length]=new Option(_city[i][0][0],_city[i][1][0]);
//     }
//  }
//    objCity.options[0]=new Option("--请选择城市--","001"); 
// }
// 
// function loadCity(obj,id)
// {
//  var obj1=document.getElementById(id);
//  var index=obj.selectedIndex;
//  obj1.length=0;
//  for(var i=1;i<_city[index][0].length;i++)
//  {
//    obj1.options[obj1.length]=new Option(_city[index][0][i],_city[index][1][i]);
//  }
//  obj1.selectedIndex=0;
// }